#pragma once


namespace BEngine
{
    float boxVertex[] = {
        -0.5f,  0.5f,  0.5f,  0.0f, 1.0f, 1.0f, 1.0f,// 左上前 0
         0.5f,  0.5f,  0.5f,  0.0f, 0.0f, 1.0f, 1.0f,// 右上前 1
        -0.5f, -0.5f,  0.5f,  0.0f, 0.0f, 1.0f, 1.0f,// 左下前 2
         0.5f, -0.5f,  0.5f,  1.0f, 0.0f, 1.0f, 1.0f,// 右下前 3
                                                          
        -0.5f,  0.5f, -0.5f,  1.0f, 1.0f, 1.0f, 1.0f, // 左上后 4
         0.5f,  0.5f, -0.5f,  1.0f, 1.0f, 1.0f, 1.0f, // 右上后 5
        -0.5f, -0.5f, -0.5f,  0.0f, 0.0f, 1.0f, 1.0f, // 左下后 6
         0.5f, -0.5f, -0.5f,  1.0f, 0.0f, 1.0f, 1.0f // 右下后 7
    };

    unsigned int boxIndex[] =
    {
        0, 1, 2,
        2, 1, 3,
        7, 5, 4,
        4, 6, 7,
        0, 2, 6,
        6, 4, 0,
        7, 3, 1,
        1, 5, 7
    };











}